import random
HANGMAN_PICS = ['''
  +-----+
        |
        |
        |
        |
      =====''','''

  +-----+ 
    0   |
        |
        |
        |
      =====''','''

  +-----+
    0   |
    |   |
        |
        |
      =====''','''

  +-----+
    0   |
   /|   |
        |
        |
      =====''','''

  +-----+
    0   |
   /|\  |
        |
        |
      =====''','''

  +-----+
    0   |
   /|\  |
    |   |
        |
      =====''','''

  +-----+
    0   |
   /|\  |
    |   |
   /    |
      =====''','''

  +-----+
    0   |
   /|\  |
    |   |
   / \  |
      =====''']
words = 'рыба волк лиса собака кошка рысь утка выдра лосось корова бык голубь воробей лягушка зебра человек таракан мышь'.split()

def getRandomWord(wordlist):
    # Эта функция возвращает случайную строку из переданного списка
    wordIndex = random.randint(0, len(wordlist)-1)  
    return wordlist(wordIndex)